#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.all: Reading...
aws_ssm_parameter.foo: Refreshing state... [id=foo]
aws_iam_role.role-launch-ec2: Refreshing state... [id=role-launch-ec2]
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=ec2_instance_profile]
data.aws_subnet_ids.public_subnets: Reading...
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0a038ffe273e528cf]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ac123e9b2f9f6dc9]
aws_security_group.sg: Refreshing state... [id=sg-0ecf005d25660f34a]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-0086c7e08f9686a98]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-084b421443cfcb750]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-08e6078c1c8efdfdd]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-04515c5c0cc6a3b7c]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-02d15ccd3b52e5319]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0b6f663793f911886]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-098d6efe9b7c412e0]
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-0a30a8a1ceddedc4d]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-04907e983cda8b829]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-04dbb45a2d8b3f2b0]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0913fab23c6fc946e]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
data.aws_subnet_ids.public_subnets: Read complete after 0s [id=vpc-0019a2de5322a3397]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-03433f2e9d1e10e7c1080289494]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-008c4bd80a2938c9f]
aws_instance.ec2_instance[5]: Refreshing state... [id=i-08d1ffdd8ed21d4af]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-0fac2590760fc4c4b]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0e0468fb16730045c]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0e0f58fc63e546404]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0a29256b27cc8d765]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0802b8fa82971a529]
aws_instance.ec2_instance[0]: Refreshing state... [id=i-0787bfa9ce8790602]
aws_instance.ec2_instance[1]: Refreshing state... [id=i-015ad917fa9603c8e]
aws_instance.ec2_instance[2]: Refreshing state... [id=i-0691587c5af850312]
aws_instance.ec2_instance[3]: Refreshing state... [id=i-02c7afd4c3a51755c]
aws_instance.ec2_instance[4]: Refreshing state... [id=i-0f5e18fcee3f1c078]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.eip[0] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-0787bfa9ce8790602"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.eip[1] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-015ad917fa9603c8e"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.eip[2] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-0691587c5af850312"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.eip[3] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-02c7afd4c3a51755c"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.eip[4] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-0f5e18fcee3f1c078"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.eip[5] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = "i-08d1ffdd8ed21d4af"
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*